In [4]:
import pandas as pd  # Make sure pandas is imported
s1 = pd.Series([43, 56, 78, 98, 45, 56])  # Changed 'series' to 'Series' with proper capitalization

In [5]:
type(s1)

pandas.core.series.Series

In [6]:
print(s1)

0    43
1    56
2    78
3    98
4    45
5    56
dtype: int64

In [10]:

s2 = pd.Series([45, 67, 89, 90, 45, 34], index = ["Subh", "sexa", "anny", "Acid", "Mummy", "Baoure"])

In [11]:
s2

Subh      45
sexa      67
anny      89
Acid      90
Mummy     45
Baoure    34
dtype: int64

In [12]:
s2["Acid"]

np.int64(90)

In [13]:
 data = {
    "name": ["Alice", "Bob", "Charlie"],
    "age": [25, 30, 35],
    "city": ["Delhi", "Mumbai", "Bangalore"]
}

In [14]:
pd.DataFrame(data)

      name  age       city
0    Alice   25      Delhi
1      Bob   30     Mumbai
2  Charlie   35  Bangalore